
# Essentials
brew "fnm"
brew "fzf"
brew "git"
brew "git-lfs"
brew "neovim"
brew "python"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "zsh"

# Needed for syncing secrets
brew "bitwarden-cli"
brew "rust"
brew "jq"

# Nice to haves
brew "pdm"
if OS.mac?
    brew "cormacrelf/tap/dark-notify"
    brew "dark-mode"
    cask "dozer"
    cask "font-fira-code-nerd-font"
    cask "karabiner-elements"
    cask "keepingyouawake"
    cask "nikitabobko/tap/aerospace"
    cask "wezterm"
end
