
brew "cloc"
brew "fzf"
brew "git"
brew "neovim"
brew "pdm"
brew "python"
brew "starship"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "zsh"
brew "fnm"

# macos
if OS.mac?
    brew "dark-mode"
    brew "cormacrelf/tap/dark-notify"
    tap "homebrew/cask-fonts"
    cask "font-fira-code-nerd-font"
    cask "iterm2-beta"
    cask "karabiner-elements"
    cask "keepingyouawake"
end
